MatejGomboc/STM32F3-Custom-USB-Device-Project/custom_usb_device_project/Src/usbd_conf.c
#include "main.h"
#include "gpio.h"
#include "usbd_custom.h"
#include "usbd_conf.h"
#include "stm32f3xx_hal.h"


PCD_HandleTypeDef hpcd;


#if (USBD_DEBUG_LEVEL > 1)

void USBD_ErrLog(const char *fmt, ...)
{
}

#endif /* USBD_DEBUG_LEVEL */


/*******************************************************************************
                       PCD BSP Routines
 *******************************************************************************/

/**
 * @brief  Initializes the PCD MSP.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
	GPIO_InitTypeDef  GPIO_InitStruct;

	/* Enable the GPIOA clock for USB DataLines */
	__HAL_RCC_GPIOA_CLK_ENABLE();

	/* Configure USB DM and DP pins */
	GPIO_InitStruct.Pin = (GPIO_PIN_11 | GPIO_PIN_12);
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF14_USB;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/* Enable USB FS Clock */
	__HAL_RCC_USB_CLK_ENABLE();

	/* Enable SYSCFG Clock */
	__HAL_RCC_SYSCFG_CLK_ENABLE();

#if defined (USE_USB_INTERRUPT_REMAPPED)
	/*USB interrupt remapping enable */
	__HAL_REMAPINTERRUPT_USB_ENABLE();
#endif

	if(hpcd->Init.low_power_enable == 1)
	{
		/* Enable EXTI Line 18 for USB wakeup */
		__HAL_USB_WAKEUP_EXTI_CLEAR_FLAG();
		__HAL_USB_WAKEUP_EXTI_ENABLE_RISING_EDGE();
		__HAL_USB_WAKEUP_EXTI_ENABLE_IT();

#if defined (USE_USB_INTERRUPT_DEFAULT)
		/* USB Default Wakeup Interrupt */
		HAL_NVIC_EnableIRQ(USBWakeUp_IRQn);

		/* Enable USB Wake-up interrupt */
		HAL_NVIC_SetPriority(USBWakeUp_IRQn, 0, 0);

#elif defined (USE_USB_INTERRUPT_REMAPPED)

		/* USB Remapped Wakeup Interrupt */
		HAL_NVIC_EnableIRQ(USBWakeUp_RMP_IRQn);

		/* Enable USB Wake-up interrupt */
		HAL_NVIC_SetPriority(USBWakeUp_RMP_IRQn, 0, 0);
#endif

	}
#if defined (USE_USB_INTERRUPT_DEFAULT)

	/* Set USB Default FS Interrupt priority */
	HAL_NVIC_SetPriority(USB_LP_CAN_RX0_IRQn, 0x0F, 0);

	/* Enable USB FS Interrupt */
	HAL_NVIC_EnableIRQ(USB_LP_CAN_RX0_IRQn);

#elif defined (USE_USB_INTERRUPT_REMAPPED)
	/* Set USB Remapped FS Interrupt priority */
	HAL_NVIC_SetPriority(USB_LP_IRQn, 0x0F, 0);

	/* Enable USB FS Interrupt */
	HAL_NVIC_EnableIRQ(USB_LP_IRQn);
#endif
}


/**
 * @brief  De-Initializes the PCD MSP.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_MspDeInit(PCD_HandleTypeDef *hpcd)
{
	/* Disable USB FS Clock */
	__HAL_RCC_USB_CLK_DISABLE();

	/* Disable SYSCFG Clock */
	__HAL_RCC_SYSCFG_CLK_DISABLE();
}


/*******************************************************************************
                       LL Driver Callbacks (PCD -> USB Device Library)
 *******************************************************************************/

/**
 * @brief  SetupStage callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_LL_SetupStage(hpcd->pData, (uint8_t *)hpcd->Setup);
}


/**
 * @brief  DataOut Stage callback.
 * @param  hpcd: PCD handle
 * @param  epnum: Endpoint Number
 * @retval None
 */
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	USBD_LL_DataOutStage(hpcd->pData, epnum, hpcd->OUT_ep[epnum].xfer_buff);
}


/**
 * @brief  DataIn Stage callback.
 * @param  hpcd: PCD handle
 * @param  epnum: Endpoint Number
 * @retval None
 */
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	USBD_LL_DataInStage(hpcd->pData, epnum, hpcd->IN_ep[epnum].xfer_buff);
}


/**
 * @brief  SOF callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_LL_SOF(hpcd->pData);
}


/**
 * @brief  Reset callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{   
	USBD_LL_SetSpeed(hpcd->pData, USBD_SPEED_FULL);
	/* Reset Device */
	USBD_LL_Reset(hpcd->pData);
}


/**
 * @brief  Suspend callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
	/* Turn off blue LED (LD4), indicating USB device suspended. */
	MX_GPIO_Set_LD4(false);

	/* Inform USB library that core enters in suspend Mode */
	USBD_LL_Suspend(hpcd->pData);

	/* Enter in STOP mode */
	if (hpcd->Init.low_power_enable)
	{
		MX_GPIO_DeInit();

		/* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register */
		SCB->SCR |= (uint32_t)((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
	}
}


/**
 * @brief  Resume callback.
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
	if (hpcd->Init.low_power_enable)
	{
		SystemClock_Config();

		/* Reset SLEEPDEEP bit of Cortex System Control Register */
		SCB->SCR &= (uint32_t)~((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
	}
	USBD_LL_Resume(hpcd->pData);

	MX_GPIO_Init();

	/* Turn on blue LED (LD4), indicating USB device connected. */
	MX_GPIO_Set_LD4(true);
}


/**
 * @brief  ISOOUTIncomplete callback.
 * @param  hpcd: PCD handle
 * @param  epnum: Endpoint Number
 * @retval None
 */
void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	USBD_LL_IsoOUTIncomplete(hpcd->pData, epnum);
}


/**
 * @brief  ISOINIncomplete callback.
 * @param  hpcd: PCD handle
 * @param  epnum: Endpoint Number
 * @retval None
 */
void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	USBD_LL_IsoINIncomplete(hpcd->pData, epnum);
}


/**
 * TODO !!!
 * @brief  ConnectCallback callback. NEVER EXECUTED
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_LL_DevConnected(hpcd->pData);
}


/**
 * TODO !!!
 * @brief  Disconnect callback. NEVER EXECUTED
 * @param  hpcd: PCD handle
 * @retval None
 */
void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_LL_DevDisconnected(hpcd->pData);
}


/*******************************************************************************
                       LL Driver Interface (USB Device Library --> PCD)
 *******************************************************************************/

/**
 * @brief  Initializes the Low Level portion of the Device driver.
 * @param  pdev: Device handle
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_Init(USBD_HandleTypeDef *pdev)
{    
	/* Set LL Driver parameters */
	hpcd.Instance = USB;
	hpcd.Init.dev_endpoints = 1;
	hpcd.Init.ep0_mps = PCD_EP0MPS_64;
	hpcd.Init.phy_itface = PCD_PHY_EMBEDDED;
	hpcd.Init.speed = PCD_SPEED_FULL;
	hpcd.Init.low_power_enable = 1;
	/* Link The driver to the stack */
	hpcd.pData = pdev;
	pdev->pData = &hpcd;
	/* Initialize LL Driver */
	HAL_PCD_Init(pdev->pData);

	HAL_PCDEx_PMAConfig(pdev->pData , 0x00 , PCD_SNG_BUF, 0x10);
	HAL_PCDEx_PMAConfig(pdev->pData , 0x80 , PCD_SNG_BUF, 0x50);

	return USBD_OK;
}


/**
 * @brief  De-Initializes the Low Level portion of the Device driver.
 * @param  pdev: Device handle
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_DeInit(USBD_HandleTypeDef *pdev)
{
	HAL_PCD_DeInit(pdev->pData);
	return USBD_OK;
}


/**
 * @brief  Starts the Low Level portion of the Device driver.
 * @param  pdev: Device handle
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_Start(USBD_HandleTypeDef *pdev)
{
	HAL_PCD_Start(pdev->pData);
	return USBD_OK;
}


/**
 * @brief  Stops the Low Level portion of the Device driver.
 * @param  pdev: Device handle
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_Stop(USBD_HandleTypeDef *pdev)
{
	HAL_PCD_Stop(pdev->pData);
	return USBD_OK;
}


/**
 * @brief  Opens an endpoint of the Low Level Driver.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @param  ep_type: Endpoint Type
 * @param  ep_mps: Endpoint Max Packet Size
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_OpenEP(USBD_HandleTypeDef *pdev,
		uint8_t ep_addr,
		uint8_t ep_type,
		uint16_t ep_mps)
{
	HAL_PCD_EP_Open(pdev->pData,
			ep_addr,
			ep_mps,
			ep_type);

	return USBD_OK;
}


/**
 * @brief  Closes an endpoint of the Low Level Driver.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_CloseEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
	HAL_PCD_EP_Close(pdev->pData, ep_addr);
	return USBD_OK;
}


/**
 * @brief  Flushes an endpoint of the Low Level Driver.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_FlushEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
	HAL_PCD_EP_Flush(pdev->pData, ep_addr);
	return USBD_OK;
}


/**
 * @brief  Sets a Stall condition on an endpoint of the Low Level Driver.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_StallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
	HAL_PCD_EP_SetStall(pdev->pData, ep_addr);
	return USBD_OK;
}


/**
 * @brief  Clears a Stall condition on an endpoint of the Low Level Driver.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_ClearStallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
	HAL_PCD_EP_ClrStall(pdev->pData, ep_addr);
	return USBD_OK;
}


/**
 * @brief  Returns Stall condition.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @retval Stall (1: Yes, 0: No)
 */
uint8_t USBD_LL_IsStallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
	PCD_HandleTypeDef *hpcd = pdev->pData;

	if((ep_addr & 0x80) == 0x80)
	{
		return hpcd->IN_ep[ep_addr & 0x7F].is_stall;
	}
	else
	{
		return hpcd->OUT_ep[ep_addr & 0x7F].is_stall;
	}
}


/**
 * @brief  Assigns a USB address to the device.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_SetUSBAddress(USBD_HandleTypeDef *pdev, uint8_t dev_addr)
{
	HAL_PCD_SetAddress(pdev->pData, dev_addr);
	return USBD_OK;
}


/**
 * @brief  Transmits data over an endpoint.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @param  pbuf: Pointer to data to be sent
 * @param  size: Data size
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_Transmit(USBD_HandleTypeDef *pdev, 
		uint8_t ep_addr,
		uint8_t *pbuf,
		uint16_t size)
{
	HAL_PCD_EP_Transmit(pdev->pData, ep_addr, pbuf, size);
	return USBD_OK;
}


/**
 * @brief  Prepares an endpoint for reception.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @param  pbuf: Pointer to data to be received
 * @param  size: Data size
 * @retval USBD Status
 */
USBD_StatusTypeDef USBD_LL_PrepareReceive(USBD_HandleTypeDef *pdev, 
		uint8_t ep_addr,
		uint8_t *pbuf,
		uint16_t size)
{
	HAL_PCD_EP_Receive(pdev->pData, ep_addr, pbuf, size);
	return USBD_OK;
}


/**
 * @brief  Returns the last transfered packet size.
 * @param  pdev: Device handle
 * @param  ep_addr: Endpoint Number
 * @retval Recived Data Size
 */
uint32_t USBD_LL_GetRxDataSize(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
	return HAL_PCD_EP_GetRxCount(pdev->pData, ep_addr);
}


/**
 * @brief  Delays routine for the USB Device Library.
 * @param  Delay: Delay in ms
 * @retval None
 */
void USBD_LL_Delay(uint32_t Delay)
{
	HAL_Delay(Delay);
}


/**
 * @brief  Software Device Connection
 * @param  hpcd: PCD handle
 * @param  state: connection state (0 : disconnected / 1: connected)
 * @retval None
 */
void HAL_PCDEx_SetConnectionState(PCD_HandleTypeDef *hpcd, uint8_t state)
{
	/* The STM32F3 Discovery Board emmbeds the external
     DP Pull-UP 1.5 K resistor R16 */ 
}
